In [40]:
import pandas as pd
import numpy as np

In [41]:
import sys
sys.path.append("../src")
from cleaning_function import normalize_text

In [42]:
df = pd.read_csv("../data/salaries.csv")

Analisis Basico

In [43]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,EX,FT,Head of Data,348516,USD,348516,US,0,US,M
1,2025,EX,FT,Head of Data,232344,USD,232344,US,0,US,M
2,2025,SE,FT,Data Scientist,145400,USD,145400,US,0,US,M
3,2025,SE,FT,Data Scientist,81600,USD,81600,US,0,US,M
4,2025,MI,FT,Engineer,160000,USD,160000,US,100,US,M

In [44]:
df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  151445.000000  1.514450e+05  151445.000000  151445.000000
mean     2024.435313  1.628380e+05  157527.458411      20.938625
std         0.671842  2.080124e+05   74150.772377      40.620393
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060000e+05  105800.000000       0.000000
50%      2025.000000  1.470000e+05  146100.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

Validacion de datos

In [45]:
contador = df.isna().sum().sum()

if contador > 0:
    print(f"Existen {contador} NaN")
else:
    print("No se encontraron NaN")

No se encontraron NaN

In [46]:
df.shape

(151445, 11)

In [47]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

Normalizacion de datos

In [48]:
df["job_title"] = df["job_title"].str.replace(" ","_")

In [49]:
df["job_title"] = df["job_title"].str.lower()

In [50]:
df["job_title"] = df["job_title"].str.strip()

In [51]:
df["experience_level"] = df["experience_level"].map({
    "EN": "junior",
    "MI": "mid",
    "SE": "senior",
    "EX": "executive"
})